Revit 2027 API
RebarShape.HigherEnd Property
 Defines the higher end of rebar shape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int HigherEnd { get; }
Public ReadOnly Property HigherEnd As Integer
	Get
public:
property int HigherEnd {
	int get ();
}
member HigherEnd : int with get
Property Value
Int32
Remarks
 Change this property will make rebar shape's start and end hooks swap.
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace